In [2]:
import pandas as pd
from pandas import DataFrame


data = {
    "종목명": ["3R", "3SOFT", "ACTS"],
    "현재가": [1510, 1790, 1185],
    "등락률": [7.36, 1.65, 1.28],
}

df = DataFrame(data, index=["037730", "036360", "005760"])

# df.to_csv('abc/today_stock1.csv', index=True)
# df.to_csv('abc/today_stock2.csv', index=False)

print(df.head(), df.info())

# 실행할 때, 
# python 20241004.py

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 037730 to 005760
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   종목명     3 non-null      object
 1   현재가     3 non-null      int64
 2   등락률     3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 96.0+ bytes
          종목명   현재가   등락률
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28 None

# 폴더 생성
## os 라이브러리

In [1]:
import os

if not os.path.isdir("abc"): # abd라는 폴더가 없으면
    os.mkdir("abc") # 폴더 생성

In [ ]:
# df.to_csv("data.csv") # 같은 경로에 생김
# df.to_csv("abc/data.csv") # abc 폴더에 생성함

In [ ]:
df.to_excel("abc/data.excel")

## Concat
- 상하 좌우로 데이터 프레임을 이어준다

In [15]:
from pandas import DataFrame
import pandas as pd

# 첫번째 데이터프레임
data = {
    '종가': [113000, 111500],
    '거래량': [555850, 282163]
}
index = ["2019-06-21", "2019-06-20"]

df1 = DataFrame(data, index=index)
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 2019-06-21 to 2019-06-20
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   종가      2 non-null      int64
 1   거래량     2 non-null      int64
dtypes: int64(2)
memory usage: 48.0+ bytes

In [6]:
# 두번째 데이터프레임
data = {
    '종가': [110000, 483689],
    '거래량': [109000, 791946]
}
index = ["2019-06-19", "2019-06-18"]

df2 = DataFrame(data, index=index)
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 2019-06-19 to 2019-06-18
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   종가      2 non-null      int64
 1   거래량     2 non-null      int64
dtypes: int64(2)
memory usage: 48.0+ bytes

In [18]:
# 컬럼이 다른 두번째 데이터프레임을 합치면 Nan 발생 그냥 합쳐진다
# data = {
#     '종가': [110000, 483689],
#     '거래량': [109000, 791946],
#     'temp' : [1,2]
# }
# index = ["2019-06-19", "2019-06-18"]

# df2 = DataFrame(data, index=index)
# df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   종가      2 non-null      int64
 1   거래량     2 non-null      int64
 2   temp    2 non-null      int64
dtypes: int64(3)
memory usage: 64.0 bytes

In [ ]:
# index가 다른 두번째 데이터프레임도 그냥 합쳐진다
# 합쳐지기 전에 setting 다 하고 합치는게 훨씬 수월
# data = {
#     '종가': [110000, 483689],
#     '거래량': [109000, 791946],
#     'temp' : [1,2]
# }
# index = [0, 1]

# df2 = DataFrame(data, index=index)
# df2.info()

In [19]:
result = pd.concat([df1, df2], axis)
result

                종가     거래량  temp
2019-06-21  113000  555850   NaN
2019-06-20  111500  282163   NaN
0           110000  109000   1.0
1           483689  791946   2.0

## Merge
- 공통 되는 것만 합쳐짐 (SQL에서 join과 유사)
- inner or left 주로 사용

In [25]:
from pandas import DataFrame
import pandas as pd

# 첫 번째 데이터프레임
data = [
    ["전기전자", "005930", "삼성전자", 74400],
    ["화학", "051910", "LG화학", 896000],
    ["전기전자", "000660", "SK하이닉스", 101500]
]

columns = ["업종", "종목코드", "종목명", "현재가"]
df1 = DataFrame(data=data, columns=columns)

# 두 번째 데이터프레임
data = [
    ["은행", 2.92],
    ["보험", 0.37],
    ["화학", 0.06],
    ["전기전자", -2.43]
]

columns = ["업종", "등락률"]
df2 = DataFrame(data=data, columns=columns)
df2

     업종   등락률
0    은행  2.92
1    보험  0.37
2    화학  0.06
3  전기전자 -2.43

In [38]:
pd.merge(left = df1, right = df2, on = '업종')

     업종    종목코드     종목명     현재가   등락률
0  전기전자  005930    삼성전자   74400 -2.43
1    화학  051910    LG화학  896000  0.06
2  전기전자  000660  SK하이닉스  101500 -2.43

In [40]:
from pandas import DataFrame
import pandas as pd

# 첫 번째 데이터프레임
data = [
    ["전기전자", "005930", "삼성전자", 74400],
    ["화학", "051910", "LG화학", 896000],
    ["서비스업", "035720", "카카오", 101500]
]

columns = ["업종", "종목코드", "종목명", "현재가"]
df1 = DataFrame(data=data, columns=columns)

df1

     업종    종목코드   종목명     현재가
0  전기전자  005930  삼성전자   74400
1    화학  051910  LG화학  896000
2  서비스업  035720   카카오  101500

In [48]:
# 두 번째 데이터프레임
data = [
    ["은행", 2.92],
    ["보험", 0.37],
    ["화학", 0.06],
    ["전기전자", -2.43]
]

columns = ["업종", "등락률"]
df2 = DataFrame(data=data, columns=columns)
df2

     업종   등락률
0    은행  2.92
1    보험  0.37
2    화학  0.06
3  전기전자 -2.43

In [52]:
df = pd.merge(left = df1, right = df2, how='outer', on = '업종') # inner가 기본, outer는 full join
df

     업종    종목코드   종목명       현재가   등락률
0    보험     NaN   NaN       NaN  0.37
1  서비스업  035720   카카오  101500.0   NaN
2    은행     NaN   NaN       NaN  2.92
3  전기전자  005930  삼성전자   74400.0 -2.43
4    화학  051910  LG화학  896000.0  0.06

In [62]:
### Merge 기준 컬럼명이 다른 경우 ###

# 첫 번째 데이터프레임
data = [
    ["전기전자", "005930", "삼성전자", 74400],
    ["화학", "051910", "LG화학", 896000],
    ["서비스업", "035720", "카카오", 101500]
]

columns = ["업종", "종목코드", "종목명", "현재가"]
df1 = DataFrame(data=data, columns=columns)

# 두 번째 데이터프레임
data = [
    ["은행", 2.92],
    ["보험", 0.37],
    ["화학", 0.06],
    ["전기전자", -2.43]
]

columns = ["항목", "등락률"]
df2 = DataFrame(data=data, columns=columns)

df = pd.merge(left = df1, right = df2, how='left', left_on = '업종', right_on= "항목") 
# 업종이라는 항목이 한쪽에만 있어서 key error 발생, rename이나 항목을 통해서 맞춰주는 것을 권장
# 이름이 다르다면 left_on, right_on을 통해 기준값을 매칭해준다.
df

     업종    종목코드   종목명     현재가    항목   등락률
0  전기전자  005930  삼성전자   74400  전기전자 -2.43
1    화학  051910  LG화학  896000    화학  0.06
2  서비스업  035720   카카오  101500   NaN   NaN

## join

In [66]:
data = [
    ["전기전자", "005930", "삼성전자", 74400],
    ["화학", "051910", "LG화학", 896000],
    ["서비스업", "035720", "카카오", 101500]
]

columns = ["업종", "종목코드", "종목명", "현재가"]
df1 = DataFrame(data=data, columns=columns)
df1 = df1.set_index("업종")
print(df1)

# 두 번째 데이터프레임
data = [
    ["은행", 2.92],
    ["보험", 0.37],
    ["화학", 0.06],
    ["전기전자", -2.43]
]

columns = ["항목", "등락률"]
df2 = DataFrame(data=data, columns=columns)
df2 = df2.set_index("항목")
print(df2)

        종목코드   종목명     현재가
업종
전기전자  005930  삼성전자   74400
화학    051910  LG화학  896000
서비스업  035720   카카오  101500
       등락률
항목
은행    2.92
보험    0.37
화학    0.06
전기전자 -2.43

In [71]:
# merge = 기본값 : inner join
# join = 기본값 : left join
# ==> 그냥 함수 내 how를 써서 명시적으로 적어주는게 안헷갈림

df1.join(other=df2, how = "inner")

        종목코드   종목명     현재가   등락률
전기전자  005930  삼성전자   74400 -2.43
화학    051910  LG화학  896000  0.06

In [87]:
data = [
    ["2017", "삼성", 500],
    ["2017", "LG", 300],    
    ["2017", "SK하이닉스", 200],
    ["2018", "삼성", 600],
    ["2018", "LG", 400],
    ["2018", "SK하이닉스", 300],    
]

columns = ["연도", "회사", "시가총액"]
df = DataFrame(data=data, columns=columns)
df

     연도      회사  시가총액
0  2017      삼성   500
1  2017      LG   300
2  2017  SK하이닉스   200
3  2018      삼성   600
4  2018      LG   400
5  2018  SK하이닉스   300

# 연도별로 그룹바이 연산, 시가총액 평균

In [88]:
result = df.groupby(by = ['연도'])['시가총액'].mean().to_frame()
#result = df.groupby('연도')['시가총액'].mean().to_frame()

result.columns = ['시가총액평균']
result

          시가총액평균
연도
2017  333.333333
2018  433.333333

In [103]:
result

              시가총액
연도   회사
2017 LG      300.0
     SK하이닉스  200.0
     삼성      500.0
2018 LG      400.0
     SK하이닉스  300.0
     삼성      600.0

In [106]:
# 한열씩 값을 가져오는 방법

result = df.groupby(by = ['연도','회사'])['시가총액'].mean().to_frame()
#result = df.groupby('연도')['시가총액'].mean().to_frame()

filtered_result = result.loc[(result.index.get_level_values('연도') == '2017') & 
                              (result.index.get_level_values('회사') == '삼성') ]
filtered_result1 = result.loc[(result.index.get_level_values('연도') == '2018') & 
                              (result.index.get_level_values('회사') == '삼성') ]

(          시가총액
 연도   회사
 2017 삼성  500.0,
           시가총액
 연도   회사
 2018 삼성  600.0)

In [80]:
result.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 2017 to 2018
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   시가총액평균  2 non-null      float64
dtypes: float64(1)
memory usage: 140.0+ bytes

In [86]:
df = df.join(other = result) # df 의 연도는 컬럼이고, result의 연도는 index라서 매칭 안되고 NaN 발생함
df

     연도      회사  시가총액  시가총액평균
0  2017      삼성   500     NaN
1  2017      LG   300     NaN
2  2017  SK하이닉스   200     NaN
3  2018      삼성   600     NaN
4  2018      LG   400     NaN
5  2018  SK하이닉스   300     NaN

In [89]:
df = df.join(other = result, on="연도") # on 옵션으로 index와 컬럼을 매칭할 수 있
df

     연도      회사  시가총액      시가총액평균
0  2017      삼성   500  333.333333
1  2017      LG   300  333.333333
2  2017  SK하이닉스   200  333.333333
3  2018      삼성   600  433.333333
4  2018      LG   400  433.333333
5  2018  SK하이닉스   300  433.333333

In [109]:
# 시가총액평균을 기준값으로
# 새로운 컬럼 : 규모
# 대형주, 중소형주

import numpy as np

df['규모'] = np.where(df['시가총액'] <= df['시가총액평균'], "중소형주", "대형주")
# numpy where 을 활용해서 SERIES 연산 (pandas 데이터 구조에 바로 적용 가능하다)

df

     연도      회사  시가총액      시가총액평균    규모
0  2017      삼성   500  333.333333   대형주
1  2017      LG   300  333.333333  중소형주
2  2017  SK하이닉스   200  333.333333  중소형주
3  2018      삼성   600  433.333333   대형주
4  2018      LG   400  433.333333  중소형주
5  2018  SK하이닉스   300  433.333333  중소형주

In [115]:
df.drop("시가총액평균", axis = 1) # 행 삭제, 원본은 수정 안됨

     연도      회사  시가총액    규모
0  2017      삼성   500   대형주
1  2017      LG   300  중소형주
2  2017  SK하이닉스   200  중소형주
3  2018      삼성   600   대형주
4  2018      LG   400  중소형주
5  2018  SK하이닉스   300  중소형주

## 멀티 인덱스
- groupby 2번 이상하면 멀티 인덱스 생김

In [118]:
from pandas import DataFrame
import pandas as pd

data = [
    ["영업이익", "컨센서스", 1000, 1200],
    ["영업이익", "잠정치", 900, 1400],
    ["당기순이익", "컨센서스", 800, 900],
    ["당기순이익", "잠정치", 700, 800]
]

df = DataFrame(data=data)
df = df.set_index([0, 1])
type(df), df

(pandas.core.frame.DataFrame,
                2     3
 0     1
 영업이익  컨센서스  1000  1200
       잠정치    900  1400
 당기순이익 컨센서스   800   900
       잠정치    700   800)

In [121]:
df.loc[('영업이익', '컨센서스'),:] # 튜플형태 ?

2    1000
3    1200
Name: (영업이익, 컨센서스), dtype: int64

In [125]:
df2 = df.reset_index() # multi index 다루기 어렵다면, reset 해서 컬럼 형식으로 작업하는 것도 나쁘지 않음
df2

       0     1     2     3
0   영업이익  컨센서스  1000  1200
1   영업이익   잠정치   900  1400
2  당기순이익  컨센서스   800   900
3  당기순이익   잠정치   700   800

In [144]:
import seaborn as sns

tips = sns.load_dataset("tips")

#### 방법 1 
# result = tips.groupby(['sex', 'smoker', 'day'])['total_bill'].agg([min, max, sum]) # multi index 가져오기
result = tips.groupby(['sex', 'smoker', 'day'])['total_bill', 'tip'].mean() # multi index 가져오기
result.loc[('Male', 'Yes', 'Fri'), :][1]

result = tips.groupby(['sex', 'smoker', 'day'])[['total_bill', 'tip']].mean()
result.loc[('Male', 'Yes', 'Fri'), :][1] # 복잡


#### 방법 2
result = tips.groupby(['sex', 'smoker', 'day'])['total_bill'].mean().reset_index() # reset_index 해서 가져오기
result.loc[result['day'] == 'Fri', ['total_bill']]

C:\Users\campus3S002\AppData\Local\Temp\ipykernel_12680\2343066512.py:7: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  result = tips.groupby(['sex', 'smoker', 'day'])['total_bill', 'tip'].mean() # multi index 가져오기

ValueError: Cannot subset columns with a tuple with more than one element. Use a list instead.

### multi index leveㅣ

In [156]:
from pandas import DataFrame

data = [
    [100, 900, 800, 700],
    [1200, 1400, 900, 800]
]

columns = [
    ['영업이익', '영업이익', '당기순이익', '당기순이익'],
    ['컨센서스', '잠정치', '컨센서스', '잠정치']
]

index = ["2020/06", "2020/09"]

df = DataFrame(data=data, index=index, columns=columns)
df # 계층 구조를 띄는 구조는 level 0 (영업이익), level1(컨센서스..)으로 접근한다

         영업이익       당기순이익
         컨센서스   잠정치  컨센서스  잠정치
2020/06   100   900   800  700
2020/09  1200  1400   900  800

### 멀티 컬럼
- 아래와 같이 컬럼명 뽑아서 새로 DataFrame으로 만들어주는 작업 해야함

In [157]:
# 멀티컬럼 만들기, Level_0 -> level_1으로 컬럼명이 들어가게 된다,

level_0 = ["영업이익", "당기순이익"]
level_1 = ["컨센서스", "잠정치"]

idx = pd.MultiIndex.from_product([level_0, level_1])

# 데이터 프레임을 다시 만들어야 해요
idx

df1 = pd.DataFrame(data = data, index = ["2020/06", "2020/09"], columns = idx)
df1['영업이익']['컨센서스']

2020/06     100
2020/09    1200
Name: 컨센서스, dtype: int64